app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants"  ORDER BY "restaurants"."created_at" DESC
---
  def index
    @restaurants = Restaurant.order(created_at: :desc)

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 6]]
---
  def show
    @restaurant = Restaurant.find_by(id: params[:id])
    @reviews = Review.where(restaurant_id: params[:id])

INSERT INTO "restaurants" ("name", "address", "city", "state", "zip_code", "description", "category", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @restaurant = Restaurant.new(restaurant_params)
    if @restaurant.save