app/controllers/reviews_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 2]]
---
  def new
    @review = Review.new
    @restaurant = Restaurant.find(params[:restaurant_id])

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "reviews" ("rating", "body", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["rating", 3], ["body", "This is such an awesome restaurant"], ["restaurant_id", 2], ["created_at", "2015-06-26 15:19:20.056743"], ["updated_at", "2015-06-26 15:19:20.056743"]]
---
  def create
    @restaurant = Restaurant.find(params[:restaurant_id])
    @review = Review.new(review_params)
    @review.restaurant = @restaurant

    if @review.save